[
  {
    "id": 1,
    "section_number": "1.1",
    "title": "Purpose of The Standard for Project Management",
    "full_title": "1.1 Purpose of The Standard for Project Management",
    "chapter": "1 INTRODUCTION",
    "main_chapter": "THE STANDARD FOR PROJECT MANAGEMENT",
    "content": "The Standard for Project Management provides a basis for understanding project management and how it enables intended outcomes. This standard applies regardless of industry, location, size, or delivery approach, for example, predictive, hybrid, or adaptive. It describes the system within which projects operate, including governance, possible functions, the project environment, and considerations for the relationship between project management and product management. The standard is a foundational reference for stakeholders participating in a project. This includes, but is not limited to, project practitioners, consultants, educators, students, sponsors, stakeholders, and vendors who:\n▶ Are responsible or accountable for delivering project outcomes;\n▶ Work on projects full or part time;\n▶ Work in portfolio, program, or project management offices (PMOs);\n▶ Are involved in project sponsorship, product ownership, product management, executive leadership, or project governance;\n▶ Are involved with portfolio or program management;\n▶ Provide resources for project work;\n▶ Focus on value delivery for portfolios, programs, and projects;\n▶ Teach or study project management; and\n▶ Are involved in any aspect of the project value delivery chain.\nThe purpose of this standard is to provide a basis for understanding project management and how it enables intended outcomes. This standard applies regardless of industry, location, size, or delivery approach, for example, predictive, hybrid, or adaptive. It describes the system within which projects operate, including governance, possible functions, the project environment, and considerations for the relationship between project management and product management. This standard is a foundational reference for stakeholders participating in a project. This includes, but is not limited to, project practitioners, consultants, educators, students, sponsors, stakeholders, and vendors who are responsible or accountable for delivering project outcomes; work on projects full or part time; work in portfolio, program, or project management offices (PMOs); are involved in project sponsorship, product ownership, product management, executive leadership, or project governance; are involved with portfolio or program management; provide resources for project work; focus on value delivery for portfolios, programs, and projects; teach or study project management; and are involved in any aspect of the project value delivery chain.",
    "word_count": 303,
    "sentence_count": 10,
    "created_at": "2025-01-27T12:00:00.000Z"
  },
  {
    "id": 2,
    "section_number": "1.2",
    "title": "Key Terms and Concepts",
    "full_title": "1.2 Key Terms and Concepts",
    "chapter": "1 INTRODUCTION",
    "main_chapter": "THE STANDARD FOR PROJECT MANAGEMENT",
    "content": "The Standard for Project Management reflects the progression of the profession. Organizations expect projects to deliver outcomes in addition to outputs and artifacts. Project managers are expected to deliver projects that create value for the organization and stakeholders within the organization’s system for value delivery. The following terms are defined to provide context for the content in this standard.\n▶ Outcome. An end result or consequence of a process or project. Outcomes can include outputs and artifacts, but have a broader intent by focusing on the benefits and value that the project was undertaken to deliver.\n▶ Portfolio. Projects, programs, subsidiary portfolios, and operations managed as a group to achieve strategic objectives.\n▶ Product. An artifact that is produced, is quantifiable, and can be either an end item in itself or a component item.\n▶ Program. Related projects, subsidiary programs, and program activities that are managed in a coordinated manner to obtain benefits not available from managing them individually.\n▶ Project. A temporary endeavor undertaken to create a unique product, service, or result. The temporary nature of projects indicates a beginning and an end to the project work or a phase of the project work. Projects can stand alone or be part of a program or portfolio.\n▶ Project management. The application of knowledge, skills, tools, and techniques to project activities to meet project requirements. Project management refers to guiding the project work to deliver the intended outcomes. Project teams can achieve the outcomes using a broad range of approaches (e.g., predictive, hybrid, and adaptive).\n▶ Project manager. The person assigned by the performing organization to lead the project team that is responsible for achieving the project objectives. Project managers perform a variety of functions, such as facilitating the project team work to achieve the outcomes and managing the processes to deliver intended outcomes. Additional functions are identified in Section 2.3.\n▶ Project team. A set of individuals performing the work of the project to achieve its objectives.\n▶ System for value delivery. A collection of strategic business activities aimed at building, sustaining, and/or advancing an organization. Portfolios, programs, projects, products, and operations can all be part of an organization’s system for value delivery.\n▶ Value. The worth, importance, or usefulness of something. Different stakeholders perceive value in different ways. Customers can define value as the ability to use specific features or functions of a product. Organizations can focus on business value as determined with financial metrics, such as the benefits less the cost of achieving those benefits. Societal value can include the contribution to groups of people, communities, or the environment.\nFor other terms used in this standard, refer to the Glossary and the PMI Lexicon of Project Management Terms [1].",
    "word_count": 391,
    "sentence_count": 12,
    "created_at": "2025-01-27T12:00:00.000Z"
  },
  {
    "id": 3,
    "section_number": "1.3",
    "title": "Audience for this Standard",
    "full_title": "1.3 Audience for this Standard",
    "chapter": "1 INTRODUCTION",
    "main_chapter": "THE STANDARD FOR PROJECT MANAGEMENT",
    "content": "This standard provides a foundational reference for stakeholders participating in a project. This includes, but is not limited to, project practitioners, consultants, educators, students, sponsors, stakeholders, and vendors who:\n▶ Are responsible or accountable for delivering project outcomes;\n▶ Work on projects full or part time;\n▶ Work in portfolio, program, or project management offices (PMOs);\n▶ Are involved in project sponsorship, product ownership, product management, executive leadership, or project governance;\n▶ Are involved with portfolio or program management;\n▶ Provide resources for project work;\n▶ Focus on value delivery for portfolios, programs, and projects;\n▶ Teach or study project management; and\n▶ Are involved in any aspect of the project value delivery chain.\nThis standard provides a foundational reference for stakeholders participating in a project. This includes, but is not limited to, project practitioners, consultants, educators, students, sponsors, stakeholders, and vendors who are responsible or accountable for delivering project outcomes; work on projects full or part time; work in portfolio, program, or project management offices (PMOs); are involved in project sponsorship, product ownership, product management, executive leadership, or project governance; are involved with portfolio or program management; provide resources for project work; focus on value delivery for portfolios, programs, and projects; teach or study project management; and are involved in any aspect of the project value delivery chain.",
    "word_count": 197,
    "sentence_count": 10,
    "created_at": "2025-01-27T12:00:00.000Z"
  },
  {
    "id": 4,
    "section_number": "2.1",
    "title": "Creating Value",
    "full_title": "2.1 Creating Value",
    "chapter": "2 A SYSTEM FOR VALUE DELIVERY",
    "main_chapter": "THE STANDARD FOR PROJECT MANAGEMENT",
    "content": "Projects exist within a larger system, such as a governmental agency, organization, or contractual arrangement. For the sake of brevity, this standard uses the term organization when referring to government agencies, enterprises, contractual arrangements, joint ventures, and other arrangements. Organizations create value for stakeholders. Examples of ways that projects produce value include, but are not limited to:\n▶ Creating a new product, service, or result that meets the needs of customers or end users;\n▶ Creating positive social or environmental contributions;\n▶ Improving efficiency, productivity, effectiveness, or responsiveness;\n▶ Enabling the changes needed to facilitate organizational transition to its desired future state; and\n▶ Sustaining benefits enabled by previous programs, projects, or business operations.\nProjects exist within a larger system, such as a governmental agency, organization, or contractual arrangement. For the sake of brevity, this standard uses the term organization when referring to government agencies, enterprises, contractual arrangements, joint ventures, and other arrangements. Organizations create value for stakeholders. Examples of ways that projects produce value include, but are not limited to, creating a new product, service, or result that meets the needs of customers or end users; creating positive social or environmental contributions; improving efficiency, productivity, effectiveness, or responsiveness; enabling the changes needed to facilitate organizational transition to its desired future state; and sustaining benefits enabled by previous programs, projects, or business operations.",
    "word_count": 219,
    "sentence_count": 8,
    "created_at": "2025-01-27T12:00:00.000Z"
  },
  {
    "id": 5,
    "section_number": "2.1.1",
    "title": "Value Delivery Components",
    "full_title": "2.1.1 Value Delivery Components",
    "chapter": "2 A SYSTEM FOR VALUE DELIVERY",
    "main_chapter": "THE STANDARD FOR PROJECT MANAGEMENT",
    "content": "There are various components, such as portfolios, programs, projects, products, and operations, that can be used individually and collectively to create value. Working together, these components comprise a system for delivering value that is aligned with the organization’s strategy. Figure 2-1 shows an example of a system to deliver value that has two portfolios comprised of programs and projects. It also shows a stand-alone program with projects and stand-alone projects not associated with portfolios or programs. Any of the projects or programs could include products. Operations can directly support and influence portfolios, programs, and projects, as well as other business functions, such as payroll, supply chain management, and so forth. Portfolios, programs, and projects influence each other as well as operations. As shown in Figure 2-2, a system for value delivery is part of an organization’s internal environment that is subject to policies, procedures, methodologies, frameworks, governance structures, and so forth. That internal environment exists within the larger external environment, which includes the economy, the competitive environment, legislative constraints, etc. Section 2.4 provides more detail on internal and external environments. The components in a value delivery system create deliverables used to produce outcomes. An outcome is the end result or consequence of a process or a project. Focusing on outcomes, choices, and decisions emphasizes the long-range performance of the project. The outcomes create benefits, which are gains realized by the organization. Benefits, in turn, create value, which is something of worth, importance, or usefulness.",
    "word_count": 278,
    "sentence_count": 6,
    "created_at": "2025-01-27T12:00:00.000Z"
  },
  {
    "id": 6,
    "section_number": "2.1.2",
    "title": "Information Flow",
    "full_title": "2.1.2 Information Flow",
    "chapter": "2 A SYSTEM FOR VALUE DELIVERY",
    "main_chapter": "THE STANDARD FOR PROJECT MANAGEMENT",
    "content": "A value delivery system works most effectively when information and feedback are shared consistently among all components, keeping the system aligned with strategy and attuned to the environment. Figure 2-3 shows a model of the flow of information where black arrows represent information from senior leadership to portfolios, portfolios to programs and projects, and then to operations. Senior leadership shares strategic information with portfolios. Portfolios share the desired outcomes, benefits, and value with programs and projects. Deliverables from programs and projects are passed on to operations along with information on support and maintenance for the deliverables. The light gray arrows in Figure 2-3 represent the reverse flow of information. Information from operations to programs and projects suggests adjustments, fixes, and updates to deliverables. Programs and projects provide performance information and progress on achieving the desired outcomes, benefits, and value to portfolios. Portfolios provide evaluations on portfolio performance with senior leadership. Additionally, operations provide information on how well the organization’s strategy is advancing.",
    "word_count": 192,
    "sentence_count": 7,
    "created_at": "2025-01-27T12:00:00.000Z"
  },
  {
    "id": 7,
    "section_number": "2.2",
    "title": "Organizational Governance Systems",
    "full_title": "2.2 Organizational Governance Systems",
    "chapter": "2 A SYSTEM FOR VALUE DELIVERY",
    "main_chapter": "THE STANDARD FOR PROJECT MANAGEMENT",
    "content": "The governance system works alongside the value delivery system to enable smooth workflows, manage issues, and support decision making. Governance systems provide a framework with functions and processes that guide activities. A governance framework can include elements of oversight, control, value assessment, integration among components, and decision-making capabilities. Governance systems provide an integrated structure for evaluating changes, issues, and risks associated with the environment and any component in the value delivery system. This includes portfolio objectives, program benefits, and deliverables produced by projects. Projects can operate within a program or portfolio or as a stand-alone activity. In some organizations, a project management office might support programs and projects within a portfolio. Project governance includes defining the authority to approve changes and make other business decisions related to the project. Project governance is aligned with program and/or organizational governance.",
    "word_count": 170,
    "sentence_count": 6,
    "created_at": "2025-01-27T12:00:00.000Z"
  },
  {
    "id": 8,
    "section_number": "2.3",
    "title": "Functions Associated with Projects",
    "full_title": "2.3 Functions Associated with Projects",
    "chapter": "2 A SYSTEM FOR VALUE DELIVERY",
    "main_chapter": "THE STANDARD FOR PROJECT MANAGEMENT",
    "content": "People drive project delivery. They do so by fulfilling functions necessary for the project to run effectively and efficiently. Functions related to the project can be fulfilled by one person, by a group of people, or combined into defined roles. Coordinating a collective work effort is extremely important to the success of any project. There are different types of coordination suitable for different contexts. Some projects benefit from decentralized coordination in which project team members self-organize and self-manage. Other projects benefit from centralized coordination with the leadership and guidance of a designated project manager or similar role. Some projects with centralized coordination can also benefit from including self-organized project teams for portions of the work. Regardless of how coordination takes place, supportive leadership models and meaningful, continuous engagements between project teams and other stakeholders underpin successful outcomes. Regardless of how projects are coordinated, the collective effort of the project team delivers the outcomes, benefits, and value. The project team may be supported by additional functions depending on the deliverables, industry, organization, and other variables. Sections 2.3.1 through 2.3.8 provide examples of functions that are often found on projects, though these are not a comprehensive list. In addition to these functions, other functions may be necessary to enable project deliverables that produce the desired outcomes. The needs of the project, organization, and environment influence which functions are used on a project and how those functions are carried out.",
    "word_count": 254,
    "sentence_count": 11,
    "created_at": "2025-01-27T12:00:00.000Z"
  },
  {
    "id": 9,
    "section_number": "2.3.1",
    "title": "Provide Oversight and Coordination",
    "full_title": "2.3.1 Provide Oversight and Coordination",
    "chapter": "2 A SYSTEM FOR VALUE DELIVERY",
    "main_chapter": "THE STANDARD FOR PROJECT MANAGEMENT",
    "content": "People in this function help the project team achieve the project objectives, typically by orchestrating the work of the project. The specifics of how this function is carried out within the project team can vary among organizations, but can include leading the planning, monitoring, and controlling activities. In some organizations, this function may involve some evaluation and analysis activities as part of pre-project activities. This function includes monitoring and working to improve the health, safety, and overall well-being of project team members. Coordination includes consulting with executive and business unit leaders on ideas for advancing objectives, improving project performance, or meeting customer needs. It can also include assisting in business analysis, tendering and contract negotiations, and business case development. Oversight can be involved in follow-on activities related to benefits realization and sustainment after the project deliverables are finalized but before formal closure of the project. This function can support portfolios and programs within which the project is initiated. Ultimately, the function is tailored to fit the organization.",
    "word_count": 199,
    "sentence_count": 5,
    "created_at": "2025-01-27T12:00:00.000Z"
  },
  {
    "id": 10,
    "section_number": "2.3.2",
    "title": "Present Objectives and Feedback",
    "full_title": "2.3.2 Present Objectives and Feedback",
    "chapter": "2 A SYSTEM FOR VALUE DELIVERY",
    "main_chapter": "THE STANDARD FOR PROJECT MANAGEMENT",
    "content": "People in this function contribute perspectives, insights, and clear direction from customers and end users. The customer and end user are not always synonymous. For the purpose of this standard, the customer is defined as the individual or group who has requested or is funding the project. The end user is the individual or group who will experience the direct use of the project deliverable. Projects need clear direction from customers and end users regarding project requirements, outcomes, and expectations. In adaptive and hybrid project environments, the need for ongoing feedback is greater because the project teams are exploring and developing product elements within specific increments. In some project environments, the customer or end user engages with the project team for periodic review and feedback. In some projects, a representative of the customer or client participates on the project team. The customer and end user input and feedback needs are determined by the nature of the project and the guidance or direction required.",
    "word_count": 194,
    "sentence_count": 7,
    "created_at": "2025-01-27T12:00:00.000Z"
  },
  {
    "id": 11,
    "section_number": "2.3.3",
    "title": "Facilitate and Support",
    "full_title": "2.3.3 Facilitate and Support",
    "chapter": "2 A SYSTEM FOR VALUE DELIVERY",
    "main_chapter": "THE STANDARD FOR PROJECT MANAGEMENT",
    "content": "The function of facilitation and support may be closely related to providing oversight and coordination, depending on the nature of the project. The work involves encouraging project team member participation, collaboration, and a shared sense of responsibility for the work output. Facilitation helps the project team create consensus around solutions, resolve conflicts, and make decisions. Facilitation is also required to coordinate meetings and contribute in an unbiased way to the advancement of project objectives. Supporting people through change and helping address obstacles that can prevent success is also required. This can include evaluating performance and providing individuals and project teams with feedback to help them learn, adapt, and improve.",
    "word_count": 148,
    "sentence_count": 5,
    "created_at": "2025-01-27T12:00:00.000Z"
  },
  {
    "id": 12,
    "section_number": "2.3.4",
    "title": "Perform Work and Contribute Insights",
    "full_title": "2.3.4 Perform Work and Contribute Insights",
    "chapter": "2 A SYSTEM FOR VALUE DELIVERY",
    "main_chapter": "THE STANDARD FOR PROJECT MANAGEMENT",
    "content": "This group of people provides the knowledge, skills, and experience necessary to produce the products and realize the outcomes of the project. Work can be full time or part time for the duration of the project or for a limited period, and the work can be colocated or virtual, depending on the environmental factors. Some work can be highly specialized, while other work can be done by project team members who have broad skill sets. Gaining insights from cross-functional project team members representing different parts of the organization can provide a mix of internal perspectives, establish alliances with key business units, and encourage project team members to act as change agents within their functional areas. This work can extend into support functions (during or after the project) as the project deliverables are implemented or transitioned into operations.",
    "word_count": 170,
    "sentence_count": 5,
    "created_at": "2025-01-27T12:00:00.000Z"
  },
  {
    "id": 13,
    "section_number": "2.3.5",
    "title": "Apply Expertise",
    "full_title": "2.3.5 Apply Expertise",
    "chapter": "2 A SYSTEM FOR VALUE DELIVERY",
    "main_chapter": "THE STANDARD FOR PROJECT MANAGEMENT",
    "content": "People in this function provide the knowledge, vision, and expertise in a specific subject for a project. They offer advice and support throughout the organization, and contribute to the project team’s learning process and work accuracy. These people can be external to the organization or can be internal project team members. They can be required for the whole project or during a specific time frame.",
    "word_count": 79,
    "sentence_count": 4,
    "created_at": "2025-01-27T12:00:00.000Z"
  },
  {
    "id": 14,
    "section_number": "2.3.6",
    "title": "Provide Business Direction and Insight",
    "full_title": "2.3.6 Provide Business Direction and Insight",
    "chapter": "2 A SYSTEM FOR VALUE DELIVERY",
    "main_chapter": "THE STANDARD FOR PROJECT MANAGEMENT",
    "content": "People in this function guide and clarify the direction of the project or product outcome. This function involves prioritizing the requirements or backlog items based on business value, dependencies, and technical or operational risk. People in this function provide feedback to project teams and set direction for the next increment or element to be developed or delivered. The function involves interacting with other stakeholders, customers, and their project teams to define the product direction. The goal is to maximize the value of the project deliverable. In adaptive and hybrid environments, direction and insight can be provided using a specific cadence. In predictive environments, there can be designated checkpoints for presentation of and feedback on project progress. In some instances, business direction can interact with funding and resourcing functions.",
    "word_count": 190,
    "sentence_count": 7,
    "created_at": "2025-01-27T12:00:00.000Z"
  },
  {
    "id": 15,
    "section_number": "2.3.7",
    "title": "Provide Resources and Direction",
    "full_title": "2.3.7 Provide Resources and Direction",
    "chapter": "2 A SYSTEM FOR VALUE DELIVERY",
    "main_chapter": "THE STANDARD FOR PROJECT MANAGEMENT",
    "content": "People in this function promote the project and communicate the organization’s vision, goals, and expectations to the project team and broader stakeholder community. They advocate for the project and the project team by helping to secure the decisions, resources, and authority that allow project activities to progress. People in this function serve as liaisons between senior management and the project team, play a supporting role in keeping projects aligned to business objectives, remove obstacles, and address issues outside the bounds of the project team’s decision authority. People in this function provide an escalation path for problems, issues, or risks that project teams cannot resolve or manage on their own, such as a shortage of funding or other resources, or deadlines that cannot be met. This function can facilitate innovation by identifying opportunities that arise within the project and communicating these to senior management. People in this function may monitor project outcomes after project closure to ensure the intended business benefits are realized.",
    "word_count": 221,
    "sentence_count": 8,
    "created_at": "2025-01-27T12:00:00.000Z"
  },
  {
    "id": 16,
    "section_number": "2.3.8",
    "title": "Maintain Governance",
    "full_title": "2.3.8 Maintain Governance",
    "chapter": "2 A SYSTEM FOR VALUE DELIVERY",
    "main_chapter": "THE STANDARD FOR PROJECT MANAGEMENT",
    "content": "People who fill a governance function approve and support recommendations made by the project team and monitor project progress in achieving the desired outcomes. They maintain linkages between project teams and strategic or business objectives that can change over the course of the project.",
    "word_count": 50,
    "sentence_count": 2,
    "created_at": "2025-01-27T12:00:00.000Z"
  },
  {
    "id": 17,
    "section_number": "2.4",
    "title": "The Project Environment",
    "full_title": "2.4 The Project Environment",
    "chapter": "2 A SYSTEM FOR VALUE DELIVERY",
    "main_chapter": "THE STANDARD FOR PROJECT MANAGEMENT",
    "content": "Projects exist and operate within internal and external environments that have varying degrees of influence on value delivery. Internal and external environments can influence planning and other project activities. These influences can yield a favorable, unfavorable, or neutral impact on project characteristics, stakeholders, or project teams.",
    "word_count": 63,
    "sentence_count": 3,
    "created_at": "2025-01-27T12:00:00.000Z"
  },
  {
    "id": 18,
    "section_number": "2.4.1",
    "title": "Internal Environment",
    "full_title": "2.4.1 Internal Environment",
    "chapter": "2 A SYSTEM FOR VALUE DELIVERY",
    "main_chapter": "THE STANDARD FOR PROJECT MANAGEMENT",
    "content": "Factors internal to the organization can arise from the organization itself, a portfolio, a program, another project, or a combination of these. They include artifacts, practices, or internal knowledge. Knowledge includes lessons learned as well as completed artifacts from previous projects. Examples include but are not limited to:\n▶ Process assets. Process assets may include tools, methodologies, approaches, templates, frameworks, patterns, or PMO resources.\n▶ Governance documentation. This documentation includes policies and processes.\n▶ Data assets. Data assets may include databases, document libraries, metrics, data, and artifacts from previous projects.\n▶ Knowledge assets. Knowledge assets may include tacit knowledge among project team members, subject matter experts, and other employees.\n▶ Security and safety. Security and safety measures may include procedures and practices for facility access, data protection, levels of confidentiality, and proprietary secrets.\n▶ Organizational culture, structure, and governance. These aspects of an organization include the vision, mission, values, beliefs, cultural norms, leadership style, hierarchy and authority relationships, organizational style, ethics, and code of conduct.\n▶ Geographic distribution of facilities and resources. These resources include work locations, virtual project teams, and shared systems.\n▶ Infrastructure. Infrastructure consists of existing facilities, equipment, organizational and telecommunications channels, information technology hardware, availability, and capacity.\n▶ Information technology software. Examples include scheduling software, configuration management systems, web interfaces to online automated systems, collaboration tools, and work authorization systems.\n▶ Resource availability. Examples include contracting and purchasing constraints, approved providers and subcontractors, and collaboration agreements. Availability related to both people and materials includes contracting and purchasing constraints, approved providers and subcontractors, and time lines.\n▶ Employee capability. Examples include general and specialized expertise, skills, competencies, techniques, and knowledge.",
    "word_count": 368,
    "sentence_count": 11,
    "created_at": "2025-01-27T12:00:00.000Z"
  },
  {
    "id": 19,
    "section_number": "2.4.2",
    "title": "External Environment",
    "full_title": "2.4.2 External Environment",
    "chapter": "2 A SYSTEM FOR VALUE DELIVERY",
    "main_chapter": "THE STANDARD FOR PROJECT MANAGEMENT",
    "content": "Factors external to the organization can enhance, constrain, or have a neutral influence on project outcomes. Examples include but are not limited to:\n▶ Marketplace conditions. Marketplace conditions include competitors, market share, brand recognition, technology trends, and trademarks.\n▶ Social and cultural influences and issues. These factors include political climate, regional customs and traditions, public holidays and events, codes of conduct, ethics, and perceptions.\n▶ Regulatory environment. The regulatory environment may include national and regional laws and regulations related to security, data protection, business conduct, employment, licensing, and procurement.\n▶ Commercial databases. Databases include standardized cost estimating data and industry risk study information.\n▶ Academic research. This research can include industry studies, publications, and benchmarking results.\n▶ Industry standards. These standards are related to products, production, environment, quality, and workmanship.\n▶ Financial considerations. These considerations include currency exchange rates, interest rates, inflation, taxes, and tariffs.\n▶ Physical environment. The physical environment pertains to working conditions and weather.",
    "word_count": 208,
    "sentence_count": 8,
    "created_at": "2025-01-27T12:00:00.000Z"
  },
  {
    "id": 20,
    "section_number": "2.5",
    "title": "Product Management Considerations",
    "full_title": "2.5 Product Management Considerations",
    "chapter": "2 A SYSTEM FOR VALUE DELIVERY",
    "main_chapter": "THE STANDARD FOR PROJECT MANAGEMENT",
    "content": "The disciplines of portfolio, program, project, and product management are becoming more interlinked. While portfolio, program, and product management are beyond the scope of this standard, understanding each discipline and the relationships between them provides a useful context for projects whose deliverables are products. A product is an artifact that is produced, is quantifiable, and can be either an end item itself or a component item. Product management involves the integration of people, data, processes, and business systems to create, maintain, and evolve a product or service throughout its life cycle. The product life cycle is a series of phases that represents the evolution of a product, from introduction through growth, maturity, and to retirement. Product management may initiate programs or projects at any point in the product life cycle to create or enhance specific components, functions, or capabilities (see Figure 2-4). The initial product may begin as a deliverable of a program or project. Throughout its life cycle, a new program or project may add or improve specific components, attributes, or capabilities that create additional value for customers and the sponsoring organization. In some instances, a program can encompass the full life cycle of a product or service to manage the benefits and create value for the organization more directly.",
    "word_count": 243,
    "sentence_count": 7,
    "created_at": "2025-01-27T12:00:00.000Z"
  },
  {
    "id": 21,
    "section_number": "3.1",
    "title": "Be a Diligent, Respectful, and Caring Steward",
    "full_title": "3.1 Be a Diligent, Respectful, and Caring Steward",
    "chapter": "3 PROJECT MANAGEMENT PRINCIPLES",
    "main_chapter": "THE STANDARD FOR PROJECT MANAGEMENT",
    "content": "Stewards act responsibly to carry out activities with integrity, care, and trustworthiness while maintaining compliance with internal and external guidelines. They demonstrate a broad commitment to financial, social, and environmental impacts of the projects they support. Stewardship encompasses responsibilities within and external to the organization. Within the organization, stewardship includes: Operating in alignment with the organization, its objectives, strategy, vision, mission, and sustainment of its long-term value; Commitment to and respectful engagement of project team members, including their compensation, access to opportunity, and fair treatment; Diligent oversight of organizational finances, materials, and other resources used within a project; and Understanding the appropriate use of authority, accountability, and responsibility, particularly in leadership positions. Stewardship outside the organization includes responsibilities in areas such as: Environmental sustainability and the organization’s use of materials and natural resources; Organization’s relationship with external stakeholders such as its partners and channels; Impact of the organization or project on the market, social community, and regions in which it operates; and Advancing the state of practice in professional industries. Stewardship reflects understanding and acceptance of trust as well as actions and decisions that engender and sustain that trust. Stewards also adhere to both implicit and explicit duties. These can include the following: Integrity. Stewards behave honestly and ethically in all engagements and communications. Stewards hold themselves to the highest standards and reflect the values, principles, and behaviors expected of those in their organization. Stewards serve as role models, building trust by living and demonstrating personal and organizational values in their engagements, work activities, and decisions. In the project management context, this duty often requires stewards to challenge team members, peers, and other stakeholders to consider their words and actions; and to be empathetic, self-reflective, and open to feedback. Care. Stewards are fiduciaries of the organizational matters in their charge, and they diligently oversee them. Higher-performing projects feature professionals who diligently oversee those matters, beyond the confines of strictly defined responsibilities. Stewards pay close attention and exercise the same level of care over those matters as they would for their personal matters. Care relates to the internal business affairs of the organization. Care for the environment, sustainable use of natural resources, and concern for the conditions of people across the planet should be reflected in the organizational policies and principles. Projects bring about changes that may have unanticipated or unwanted consequences. Project practitioners should identify, analyze, and manage the potential downsides of project outcomes so that stakeholders are aware and informed. Care includes creating a transparent working environment, open communication channels, and opportunities for stakeholders to raise concerns without penalty or fear of retribution. Trustworthiness. Stewards represent themselves, their roles, their project team, and their authority accurately, both inside and outside of the organization. This behavior allows people to understand the degree to which an individual can commit resources, make decisions, or approve something. Trustworthiness also entails individuals proactively identifying conflicts between their personal interests and those of their organization or clients. Such conflicts can undermine trust and confidence, result in unethical or illegal behaviors, create confusion, or contribute to suboptimal outcomes. Stewards protect projects from such breaches of trust. Compliance. Stewards comply with laws, rules, regulations, and requirements that are properly authorized within or outside of their organization. However, high-performing projects seek ways to integrate compliance more fully into the project culture, creating more alignment with diverse and potentially conflicting guidelines. Stewards strive for compliance with guidelines intended to protect them, their organization, their stakeholders, and the public at large. In instances where stewards face conflicting guidelines or questions regarding whether or not actions or plans align with established guidelines, stewards seek appropriate counsel and direction. Stewardship requires leadership with transparency and trustworthiness. Projects affect the lives of the people who deliver them as well as those who are affected by the project deliverables and outcomes. Projects can have effects, such as easing traffic congestion, producing new medications, or creating opportunities for people to interact. Those effects can produce negative impacts and consequences, such as reduced green space, side effects from medications, or disclosure of personal information. Project teams and their organizational leaders carefully consider such factors and impacts so they can make responsible decisions by balancing organizational and project objectives with the larger needs and expectations of global stakeholders. Increasingly, organizations are taking a holistic view to business that considers financial, technical, social, and environmental performance simultaneously instead of sequentially. Since the world is interconnected now more than ever and has finite resources and a shared environment, stewardship decisions have ramifications beyond the project.",
    "word_count": 935,
    "sentence_count": 26,
    "created_at": "2025-01-27T12:00:00.000Z"
  },
  {
    "id": 22,
    "section_number": "3.2",
    "title": "Create a Collaborative Project Team Environment",
    "full_title": "3.2 Create a Collaborative Project Team Environment",
    "chapter": "3 PROJECT MANAGEMENT PRINCIPLES",
    "main_chapter": "THE STANDARD FOR PROJECT MANAGEMENT",
    "content": "Creating a collaborative project team environment involves multiple contributing factors, such as team agreements, structures, and processes. These factors support a culture that enables individuals to work together and provide synergistic effects from interactions. Projects are delivered by project teams. Project teams work within organizational and professional cultures and guidelines, often establishing their own “local” culture. A collaborative project team environment facilitates: Alignment with other organizational cultures and guidelines, Individual and team learning and development, and Optimal contributions to deliver desired outcomes. Team agreements represent a set of behavioral parameters and working norms established by the project team and upheld through individual and project team commitment. The team agreement should be created at the beginning of a project and will evolve over time as the project team continues to work together and identify norms and behaviors that are necessary in order to continue to work together successfully. Organizational structures. Project teams use, tailor, and implement structures that help coordinate the individual effort associated with project work. Organizational structures are any arrangement of or relation between the elements of project work and organizational processes. These structures can be based on roles, functions, or authority. They can be defined as being external to the project, tailored to fit the project context, or newly designed to meet a unique project need. An authority figure may formally impose a structure, or project team members may contribute to its design in alignment with organizational structures. Examples of organizational structures that can improve collaboration include, but are not limited to: Definitions of roles and responsibilities, Allocation of employees and vendors into project teams, Formal committees tasked with a specific objective, and Standing meetings that regularly review a given topic. Processes. Project teams define processes that enable completion of tasks and work assignments. For example, project teams may agree to a decomposition process using a work breakdown structure (WBS), backlog, or task board. Project teams are influenced by the culture of the organizations involved in the project, the nature of the project, and the environment in which they operate. Within these influences, project teams establish their own team cultures. Project teams can tailor their structure to best accomplish the project objective. By fostering inclusive and collaborative environments, knowledge and expertise are more freely exchanged, which in turn enable better project outcomes. Clarity on roles and responsibilities can improve team cultures. Within project teams, specific tasks may be delegated to individuals or selected by project team members themselves. This includes the authority, accountability, and responsibility related to tasks: Authority. The condition of having the right, within a given context, to make relevant decisions, establish or improve procedures, apply project resources, expend funds, or give approvals. Authority is conferred from one entity to another, whether done explicitly or implicitly. Accountability. The condition of being answerable for an outcome. Accountability is not shared. Responsibility. The condition of being obligated to do or fulfill something. Responsibility can be shared. Regardless of who is accountable or responsible for specific project work, a collaborative project team takes collective ownership of the project outcomes. A diverse project team can enrich the project environment by bringing together different perspectives. The project team can be comprised of internal organizational staff, contracted contributors, volunteers, or external third parties. Additionally, some project team members join the project on a short-term basis to work on a specific deliverable while other members are assigned to the project on a longer-term basis. Integrating these individuals with a project team can challenge everyone involved. A team culture of respect allows for differences and finds ways to leverage them productively, encouraging effective conflict management. Another aspect of a collaborative project team environment is the incorporation of practice standards, ethical codes, and other guidelines that are part of the professional work within the project team and the organization. Project teams consider how these guides can support their efforts to avoid possible conflict among the disciplines and the established guidelines they use. A collaborative project team environment fosters the free exchange of information and individual knowledge. This, in turn, increases shared learning and individual development while delivering outcomes. A collaborative project team environment enables everyone to contribute their best efforts to deliver the desired outcomes for an organization. The organization, in turn, will benefit from deliverables and outcomes that respect and enhance its fundamental values, principles, and culture.",
    "word_count": 1095,
    "sentence_count": 36,
    "created_at": "2025-01-27T12:00:00.000Z"
  },
  {
    "id": 23,
    "section_number": "3.3",
    "title": "Effectively Engage with Stakeholders",
    "full_title": "3.3 Effectively Engage with Stakeholders",
    "chapter": "3 PROJECT MANAGEMENT PRINCIPLES",
    "main_chapter": "THE STANDARD FOR PROJECT MANAGEMENT",
    "content": "Stakeholders can be individuals, groups, or organizations that may affect, be affected by, or perceive themselves to be affected by a decision, activity, or outcome of a portfolio, program, or project. Stakeholders also directly or indirectly influence a project, its performance, or outcome in either a positive or negative way. Engage stakeholders proactively and to the degree needed to contribute to project success and customer satisfaction. Stakeholders influence projects, performance, and outcomes. Project teams serve other stakeholders by engaging with them. Stakeholder engagement proactively advances value delivery. Stakeholders can affect many aspects of a project, including but not limited to: Scope/requirements, by revealing the need to add, adjust, or remove elements of the scope and/or project requirements; Schedule, by offering ideas to accelerate delivery or by slowing down or stop delivery of key project activities; Cost, by helping to reduce or eliminate planned expenditures or by adding steps, requirements, or restrictions that increase cost or require additional resources; Project team, by restricting or enabling access to people with the skills, knowledge, and experience needed to deliver the intended outcomes, and promote a learning culture; Plans, by providing information for plans or by advocating for changes to agreed activities and work; Outcomes, by enabling or blocking work required for the desired outcomes; Culture, by establishing or influencing—or even defining—the level and character of engagement of the project team and broader organization; Benefits realization, by generating and identifying long-term goals so that the project delivers the intended identified value; Risk, by defining the risk thresholds of the project, as well as participating in subsequent risk management activities; Quality, by identifying and requiring quality requirements; and Success, by defining success factors and participating in the evaluation of success. Stakeholders may come and go throughout the life cycle of the project. Additionally, the degree of a stakeholder’s interest, influence, or impact may change over time. Stakeholders, especially those with a high degree of influence and who have an unfavorable or neutral view about a project, need to be effectively engaged so that their interests, concerns, and rights are understood. The project team can then address these concerns through effective engagement and support leading to the probability of a successful project outcome. Identifying, analyzing, and proactively engaging with stakeholders from the start to the end of the project helps to enable success. Project teams are a group of stakeholders. This group of stakeholders engages other stakeholders to understand, consider, communicate, and respond to their interests, needs, and opinions. Effective and efficient engagement and communication include determining how, when, how often, and under what circumstances stakeholders want to be—and should be—engaged. Communication is a key part of engagement; however, engagement delves deeper to include awareness of the ideas of others, assimilation of other perspectives, and collective shaping of a shared solution. Engagement includes building and maintaining solid relationships through frequent, two-way communication. It encourages collaboration through interactive meetings, face-to-face meetings, informal dialogue, and knowledge-sharing activities. Stakeholder engagement relies heavily on interpersonal skills, including taking initiative, integrity, honesty, collaboration, respect, empathy, and confidence. These skills and attitudes can help everyone adapt to the work and to each other, increasing the likelihood of success. Engagement helps project teams detect, collect, and evaluate information, data, and opinions. This creates shared understanding and alignment, which enables project outcomes. Additionally, these activities help the project team to tailor the project to identify, adjust, and respond to changing circumstances. Project teams actively engage other stakeholders throughout the project to minimize potential negative impacts and maximize positive impacts. Stakeholder engagements also enable opportunities for stronger project performance and outcomes in addition to increasing stakeholder satisfaction. Finally, engaging other stakeholders helps the project team to find solutions that may be more acceptable to a broader range of stakeholders.",
    "word_count": 669,
    "sentence_count": 20,
    "created_at": "2025-01-27T12:00:00.000Z"
  },
  {
    "id": 24,
    "section_number": "3.4",
    "title": "Focus on Value",
    "full_title": "3.4 Focus on Value",
    "chapter": "3 PROJECT MANAGEMENT PRINCIPLES",
    "main_chapter": "THE STANDARD FOR PROJECT MANAGEMENT",
    "content": "Value, including outcomes from the perspective of the customer or end user, is the ultimate success indicator and driver of projects. Value focuses on the outcome of the deliverables. The value of a project may be expressed as a financial contribution to the sponsoring or receiving organization. Value may be a measure of public good achieved, for example, social benefit or the customer’s perceived benefit from the project result. When the project is a component of a program, the project’s contribution to program outcomes can represent value. Many projects, though not all, are initiated based on a business case. Projects may be initiated due to any identified need to deliver or modify a process, product, or service, such as contracts, statements of work, or other documents. In all cases, the project intent is to provide the desired outcome that addresses the need with a valued solution. A business case can contain information about strategic alignment, assessment of risk exposure, economic feasibility study, return on investments, expected key performance measures, evaluations, and alternative approaches. The business case may state the intended value contribution of the project outcome in qualitative or quantitative terms, or both. A business case contains at least these supporting and interrelated elements: Business need. Business provides the rationale for the project, explaining why the project is undertaken. It originates with the preliminary business requirements, which are reflected in the project charter or other authorizing document. It provides details about the business goals and objectives. The business need may be intended for the performing organization, a client organization, a partnership of organizations, or public welfare. A clear statement of the business need helps the project team understand the business drivers for the future state and allows the project team to identify opportunities or problems to increase the potential value from the project outcome. Project justification. Project justification is connected to business need. It explains why the business need is worth the investment and why it should be addressed at this time. The project justification is accompanied by a cost-benefit analysis and assumptions. Business strategy. Business strategy is the reason for the project and all needs are related to the strategy to achieve the value. Together, the business need, project justification, and business strategy, in addition to benefits and possible agreements, provide the project team with information that allows them to make informed decisions to meet or exceed the intended business value. Desired outcomes should be clearly described, iteratively assessed, and updated throughout the project. During its life cycle, a project may undergo change and the project team then adapts in response. The project team continuously evaluates project progress and direction against the desired outputs, baselines, and business case to confirm that the project remains aligned to the need and will deliver its intended outcomes. Alternatively, the business case is updated to capture an opportunity or minimize a problem identified by the project team and other stakeholders. If the project or its stakeholders are no longer aligned with the business need or if the project seems unlikely to provide the intended value, the organization may choose to terminate the effort. Value is the worth, importance, or usefulness of something. Value is subjective, in the sense that the same concept can have different values for different people and organizations. This occurs because what is considered a benefit depends on organizational strategies, ranging from short-term financial gains, long-term gains, and even nonfinancial elements. Because all projects have a range of stakeholders, different values generated for each group of stakeholders have to be considered and balanced with the whole, while placing a priority on the customer perspective. Within the context of some projects, there may be different forms of value engineering that maximize value to the customer, to the performing organization, or other stakeholders. An example of this includes delivering the required functionality and level of quality with an acceptable risk exposure, while using as few resources as possible, and by avoiding waste. Sometimes, especially in adaptive projects that do not have a fixed, up-front scope, the project team can optimize value by working with the customer to determine which features are worth investment and which may not be valuable enough to be added to the output. To support value realization from projects, project teams shift focus from deliverables to the intended outcomes. Doing so allows project teams to deliver on the vision or purpose of the project, rather than simply creating a specific deliverable. While the deliverable may support the intended project outcome, it may not fully achieve the vision or purpose of the project. For example, customers may want a specific software solution because they think that the solution resolves the business need for higher productivity. The software is the output of the project, but the software itself does not enable the productivity outcome that is intended. In this case, adding a new deliverable of training and coaching on the use of the software can enable a better productivity outcome. If the project’s output fails to enable higher productivity, stakeholders may feel that the project has failed. Thus, project teams and other stakeholders understand both the deliverable and the intended outcome from the deliverable. The value contribution of project work could be a short- or long-term measure. Because value contribution may be mixed with contributions from operational activities, it may be difficult to isolate. When the project is a component of a program, evaluation of value at the program level may also be necessary to properly direct the project. A reliable evaluation of value should consider the whole context and the entire life cycle of the project’s output. While value is realized over time, effective processes can enable early benefit realization. With efficient and effective implementation, project teams may demonstrate or achieve such outcomes as prioritized delivery, better customer service, or an improved work environment. By working with organizational leaders who are responsible for putting project deliverables into use, project leaders can make sure that the deliverables are positioned to realize the planned outcomes.",
    "word_count": 1007,
    "sentence_count": 30,
    "created_at": "2025-01-27T12:00:00.000Z"
  },
  {
    "id": 25,
    "section_number": "3.5",
    "title": "Recognize, Evaluate, and Respond to System Interactions",
    "full_title": "3.5 Recognize, Evaluate, and Respond to System Interactions",
    "chapter": "3 PROJECT MANAGEMENT PRINCIPLES",
    "main_chapter": "THE STANDARD FOR PROJECT MANAGEMENT",
    "content": "A system is a set of interacting and interdependent components that function as a unified whole. Taking a holistic view, a project is a multifaceted entity that exists in dynamic circumstances, exhibiting the characteristics of a system. Project teams should acknowledge this holistic view of a project, seeing the project as a system with its own working parts. A project works within other larger systems, and a project deliverable may become part of a larger system to realize benefits. For example, projects may be part of a program which, in turn, may also be part of a portfolio. These interconnected structures are known as a system of systems. Project teams balance inside/out and outside/in perspectives to support alignment across the system of systems. The project may also have subsystems that are required to integrate effectively to deliver the intended outcome. For example, when individual project teams develop separate components of a deliverable, all components should integrate effectively. This requires project teams to interact and align subsystem work on a regular basis. Systems thinking also considers timing elements of systems, such as what the project delivers or enables over time. For example, if project deliverables are released incrementally, each increment expands the cumulative outcomes or capabilities of previous versions. Project teams should think beyond the end of the project to the operational state of the project’s deliverable, so that intended outcomes are realized. As projects unfold, internal and external conditions are continuously changing. A single change can create several impacts. For example, on a large construction project, a change in requirements can cause contractual changes with the primary contractor, subcontractors, suppliers, or others. In turn, those changes can create an impact on project cost, schedule, scope, and performance. Subsequently, these changes could invoke a change control protocol for obtaining approvals from entities in external systems, such as the service providers, regulators, financiers, and government authorities. While it is possible to predict some of the changes in advance, many of the changes that can impact the project during its life cycle emerge in real time. With systems thinking, including constant attention to internal and external conditions, the project team can navigate a wide spectrum of changes and impacts to keep the project in agreement with the relevant stakeholders. Systems thinking also applies to how the project team views itself and its interactions within the project system. The project system often brings together a diverse project team engaged in working for a common objective. This diversity brings value to project teams, but they need to consider how to leverage those differences effectively, so that the project team works cohesively. For example, if a government agency contracts with a private company for development of a new technology, the development team may consist of project team members from both organizations. Those project team members may have assumptions, ways of working, and mental models related to how they function within their home organization. In this new project system, which combines the cultures of a private company and a government agency, the project team members can establish a synthesized team culture that creates a common vision, language, and toolset. This can help project team members to engage and contribute effectively and help to increase the probability that the project system works. Because of the interactivity among systems, project teams should operate with awareness of, and vigilance toward, changing system dynamics. The following skills support a systems view of the project: Empathy with the business areas; Critical thinking with a big picture focus; Challenging of assumptions and mental models; Seeking external review and advice; Use of integrated methods, artifacts, and practices so there is a common understanding of project work, deliverables, and outcomes; Use of modeling and scenarios to envision how system dynamics may interact and react; and Proactive management of the integration to help achieve business outcomes. Recognizing, evaluating, and responding to system interactions can lead to the following positive outcomes: Early consideration of uncertainty and risk within the project, exploration of alternatives, and consideration of unintended consequences; Ability to adjust assumptions and plans throughout the project life cycle; Provision of ongoing information and insights that inform planning and delivery; Clear communication of plans, progress, and projections to relevant stakeholders; Alignment of project goals and objectives to the customer organization’s goals, objectives, and vision; Ability to adjust to the changing needs of the end user, sponsor, or customer of the project deliverables; Ability to see synergies and savings between aligned projects or initiatives; Ability to exploit opportunities not otherwise captured or see threats posed to or by other projects or initiatives; Clarity regarding the best project performance measurement and their influence on the behavior of the people involved in the project; Decisions that benefit the organization as a whole; and More comprehensive and informed identification of risks.",
    "word_count": 789,
    "sentence_count": 22,
    "created_at": "2025-01-27T12:00:00.000Z"
  },
  {
    "id": 26,
    "section_number": "3.6",
    "title": "Demonstrate Leadership Behaviors",
    "full_title": "3.6 Demonstrate Leadership Behaviors",
    "chapter": "3 PROJECT MANAGEMENT PRINCIPLES",
    "main_chapter": "THE STANDARD FOR PROJECT MANAGEMENT",
    "content": "Projects create a unique need for effective leadership. Unlike general business operations, where roles and responsibilities are often established and consistent, projects often involve multiple organizations, departments, functions, or vendors that do not interact on a regular basis. Moreover, projects may carry higher stakes and expectations than regular operational functions. As a result, a broader array of managers, executives, senior contributors, and other stakeholders attempt to influence a project. This often creates higher degrees of confusion and conflict. Consequently, higher-performing projects demonstrate effective leadership behaviors more frequently, and from more people than most projects. A project environment that prioritizes vision, creativity, motivation, enthusiasm, encouragement, and empathy can support better outcomes. These traits are often associated with leadership. Leadership comprises the attitude, talent, character, and behaviors to influence individuals within and outside the project team toward the desired outcomes. Leadership is not exclusive to any specific role. High-performing projects may feature multiple people exhibiting effective leadership skills, for example, the project manager, sponsors, stakeholders, senior management, or even project team members. Anyone working on a project can demonstrate effective leadership traits, styles, and skills to help the project team perform and deliver the required results. It is important to note that more conflict and confusion can emerge when too many participants attempt to exert project influence in multiple, misaligned directions. However, higher-performing projects show a paradoxical combination of more influencers, each contributing more leadership skills in a complementary fashion. For example: if a sponsor articulates clear priorities, then a technical lead opens the discussion for delivery options, where individual contributors assert pros and cons until the project manager brings the conversation to a consensus strategy. Successful leadership enables someone to influence, motivate, direct, and coach people under any condition. It also incorporates characteristics derived from an organization’s culture and practices. Leadership should not be confused with authority, which is the position of control given to individuals within an organization to foster overall effective and efficient function. Authority is the right to exercise power. Authority is usually delegated to a person by formal means such as a charter document or designated title. This person may then have a role or position description that indicates their authority. Authority denotes accountability for certain activities, actions of individuals, or decision making in certain circumstances. While individuals may use their authority to influence, motivate, direct others, or act when others do not perform or act as directed or requested, this is not the same as leadership. For example, organizational executives may grant someone the authority to form a project team to deliver an outcome. However, authority alone is insufficient. It takes leadership to motivate a group toward a common goal, influence them to align their individual interests in favor of collective effort, and achieve success as a project team rather than as individuals. Effective leadership draws from or combines elements of various styles of leadership. Documented leadership styles range from autocratic, democratic, laissez-faire, directive, participative, assertive, supportive, and autocratic to consensus. Of all these, no single leadership style has proven to be the universally best or recommended approach. Instead, effective leadership is shown when it best fits a given situation. For example: In moments of chaos, directive action creates more clarity and momentum than collaborative problem solving. For environments with highly competent and engaged staff, empowered delegation elicits more productivity than centralized coordination. When senior managers suffer conflict over priorities, neutral facilitation helps more than detailed recommendations. Effective leadership skill is grown. It can be learned and developed so that it becomes a professional asset to the individual, as well as a benefit to the project and its stakeholders. High-performing projects show a pervasive pattern of continuous improvement down to the personal level. A project team member deepens leadership acumen by adding or practicing a combination of various skills or techniques, including but not limited to: Focusing a project team around agreed goals; Articulating a motivating vision for the project outcomes; Seeking resources and support for the project; Generating consensus on the best way forward; Overcoming obstacles to project progress; Negotiating and resolving conflict within the project team and between the project team and other stakeholders; Adapting communication style and messaging so that they are relevant to the audience; Coaching and mentoring fellow project team members; Appreciating and rewarding positive behaviors and contributions; Providing opportunities for skill growth and development; Facilitating collaborative decision making; Employing effective conversations and active listening; Empowering project team members and delegating responsibilities to them; Building a cohesive project team that takes responsibility; Showing empathy for project team and stakeholder perspectives; Having self-awareness of one’s own bias and behaviors; Managing and adapting to change during the project life cycle; Facilitating a fail-fast/learn quickly mindset by acknowledging mistakes; and Role modeling of desired behaviors. Personal character matters in a leader. A person may have strong ability in leadership skills but then have their influence undermined by the perception of being self-serving or untrustworthy. Effective leaders seek to be a role model in areas of honesty, integrity, and ethical conduct. Effective leaders focus on being transparent, behave unselfishly, and are able to ask for help. Effective leaders understand that project team members scrutinize and emulate the values, ethics, and behaviors that leaders exhibit. Therefore, leaders have an additional responsibility to demonstrate expected behaviors through their actions. Projects work best when leaders understand what motivates people. Project teams can thrive when project team members use appropriate leadership traits, skills, and characteristics that match the specific needs and expectations of stakeholders. Knowing how to best communicate with or motivate people, or take action when required, can help improve project team performance and manage obstacles to project success. When practiced by more than one person on a project, leadership can foster shared responsibility toward the project goal, which in turn can foster a healthy and vibrant environment. Motivators include such forces as finances, recognition, autonomy, compelling purpose, growth opportunity, and personal contribution. Effective leadership promotes project success and contributes to positive project outcomes. Project teams, individual project team members, and other stakeholders are engaged throughout a well-led project. Each project team member can focus on delivering results using a common vision and working toward shared outcomes. Effective leadership is essential in helping project teams maintain an ethical and adaptable environment. Additionally, business obligations can be fulfilled based on delegated responsibility and authority. Shared leadership does not undermine or diminish the role or authority of a leader designated by the organization, nor does it diminish the need for that leader to apply the right leadership style and skills at the right time. By blending styles, continuing skill growth, and leveraging motivators, any project team member or stakeholder can motivate, influence, coach, and grow the project team, regardless of role or position.",
    "word_count": 1719,
    "sentence_count": 45,
    "created_at": "2025-01-27T12:00:00.000Z"
  },
  {
    "id": 27,
    "section_number": "3.7",
    "title": "Tailor Based on Context",
    "full_title": "3.7 Tailor Based on Context",
    "chapter": "3 PROJECT MANAGEMENT PRINCIPLES",
    "main_chapter": "THE STANDARD FOR PROJECT MANAGEMENT",
    "content": "Adapting to the unique objectives, stakeholders, and complexity of the environment contributes to project success. Tailoring is the deliberate adaptation of approach, governance, and processes to make them more suitable for the given environment and the work at hand. Project teams tailor the appropriate framework that will enable the flexibility to consistently produce positive outcomes within the context of the life cycle of the project. The business environment, team size, degree of uncertainty, and complexity of the project all factor into how project systems are tailored. Project systems can be tailored with a holistic perspective, including the consideration of interrelated complexities. Tailoring aims to maximize value, manage constraints, and improve performance by using “just enough” processes, methods, templates, and artifacts to achieve the desired outcome from the project. Together with the PMO and considering governance, project teams discuss and decide on the delivery approach and resources required for producing outcomes on a project-by-project basis. This includes the selection of the processes to use, development approach, methods, and artifacts needed to deliver the project outcomes. Tailoring decisions can be an implicit action of accepting an established methodology. Conversely, tailoring can be an explicit action of selecting and mixing specific elements to suit the unique characteristics of the project and the project environment. Tailoring is necessary to some degree in every project, because each project exists in a particular context. Projects are often unique, even when the deliverable of the project does not seem unique. This is because project contexts differ in that the organization, its customers, its channels, and its environment are dynamic elements. Those changes and ongoing learning may cause project teams to use or develop different methods or approaches in pursuit of success. The project team should examine the unique set of conditions for each project, so that they can determine the most appropriate methods of producing the desired outcomes. An existing methodology or common way of working can inform the way in which a project is tailored. A methodology is a system of practices, techniques, procedures, and rules used by those who work in a discipline. Project teams may be required to assume the methodology of the parent organization. That is, the project team adopts a system of processes, governance, methods, and templates that provide guidance on how to run the project. While this provides a degree of consistency to projects within an organization, the methodology itself may still need tailoring to suit each project. Organizational policies and procedures prescribe authorized boundaries within which the project team can tailor. Project teams can also factor in the time and cost of project management processes. Processes that are not tailored may add little value to the project or its outcomes while increasing cost and lengthening schedule. Tailoring the approach along with appropriate processes, methods, and artifacts can help project teams make decisions about process-related costs and the related value contribution to project outcomes. In addition to deciding on how to tailor an approach, project teams communicate the tailoring decisions to stakeholders associated with that approach. Each member of the project team is aware of the chosen methods and processes that relate to those stakeholders and their role. Tailoring the project approach to suit the unique characteristics of the project and its environment can contribute to a higher level of project performance and an increased probability of success. A tailored project approach can produce direct and indirect benefits to organizations, such as: Deeper commitment from project team members because they took part in defining the approach; Reduction in waste in terms of actions or resources; Customer-oriented focus, as the needs of the customer and other stakeholders are an important influencing factor in the tailoring of the project; and More efficient use of project resources, as project teams are conscious of the weight of project processes. Tailoring projects can lead to the following positive outcomes: Increased innovation, efficiency, and productivity; Lessons learned, so that improvements from a specific delivery approach can be shared and applied to the next round of work or future projects; Further improvement of an organization’s methodology, with new practices, methods, and artifacts; Discovery of improved outcomes, processes, or methods through experimentation; Effective integration within multidisciplinary project teams of methods and practices used to deliver project results; and Increased adaptability for the organization in the long term. Tailoring an approach is iterative in nature, and therefore is a constant process itself during the project life cycle. Project teams collect feedback from all stakeholders on how the methods and tailored processes are working for them as the project progresses to evaluate their effectiveness and add value to the organization.",
    "word_count": 930,
    "sentence_count": 28,
    "created_at": "2025-01-27T12:00:00.000Z"
  },
  {
    "id": 28,
    "section_number": "3.8",
    "title": "Build Quality into Processes and Deliverables",
    "full_title": "3.8 Build Quality into Processes and Deliverables",
    "chapter": "3 PROJECT MANAGEMENT PRINCIPLES",
    "main_chapter": "THE STANDARD FOR PROJECT MANAGEMENT",
    "content": "Quality is the degree to which a set of inherent characteristics of a product, service, or result fulfills the requirements. Quality includes the ability to satisfy the customer’s stated or implied needs. The product, service, or result of a project (referred to here as deliverables) is measured for the quality of both the conformance to acceptance criteria and fitness for use. Project quality entails satisfying stakeholders’ expectations and fulfilling project and product requirements. Quality focuses on meeting acceptance criteria for deliverables. Project quality entails ensuring project processes are appropriate and as effective as possible. Maintain a focus on quality that produces deliverables that meet project objectives and align to the needs, uses, and acceptance requirements set forth by relevant stakeholders. Quality may have several different dimensions, including but not limited to the following: Performance. Does the deliverable function as the project team and other stakeholders intended? Conformity. Is the deliverable fit for use, and does it meet the specifications? Reliability. Does the deliverable produce consistent metrics each time it is performed or produced? Resilience. Is the deliverable able to cope with unforeseen failures and quickly recover? Satisfaction. Does the deliverable elicit positive feedback from end users? This includes usability and user experience? Uniformity. Does the deliverable show parity with other deliverables produced in the same manner? Efficiency. Does the deliverable produce the greatest output with the least amount of inputs and effort? Sustainability. Does the deliverable produce a positive impact on economic, social, and environmental parameters? Project teams measure quality using metrics and acceptance criteria based on requirements. A requirement is a condition or capability that is necessary to be present in a product, service, or result to satisfy a need. Requirements, either explicit or implicit, may come from stakeholders, a contract, organizational policies, standards, or regulatory bodies, or a combination of these. Quality is closely linked to the product acceptance criteria, as described in the statement of work or other design documents. These criteria should be updated as experimentation and prioritization occur and validated as part of the acceptance process. Quality is also relevant to the project approaches and activities used to produce the project’s deliverables. While project teams evaluate the quality of a deliverable through inspection and testing, project activities and processes are assessed through reviews and audits. In both instances, quality activities may focus on detection and prevention of errors and defects. The objective of quality activities is to help ensure that what is delivered meets the objectives of the customer and other relevant stakeholders in the most straightforward path. The intention is to minimize the waste of resources and maximize the probability of attaining the desired outcome. This results in: Moving the deliverables to the point of delivery quickly, and Preventing defects in the deliverables or identifying them early to avoid or reduce the need for rework and scrap. The objective of quality activities is the same whether dealing with an up-front, well-defined set of requirements or a set of requirements that are progressively elaborated and incrementally delivered. Quality management processes and practices help produce deliverables and outcomes that meet project objectives and align to the expectations, uses, and acceptance criteria expressed by the organization and relevant stakeholders. Close attention to quality in project processes and deliverables creates positive outcomes, including: Project deliverables that are fit for purpose, as defined by acceptance criteria; Project deliverables that meet stakeholder expectations and business objectives; Project deliverables with minimal or no defects; Timely or expedited delivery; Enhanced cost control; Increased quality of product delivery; Reduced rework and scrap; Reduced customer complaints; Good supply chain integration; Improved productivity; Increased project team morale and satisfaction; Robust service delivery; Improved decision making; and Continually improved processes.",
    "word_count": 765,
    "sentence_count": 27,
    "created_at": "2025-01-27T12:00:00.000Z"
  },
  {
    "id": 29,
    "section_number": "3.9",
    "title": "Navigate Complexity",
    "full_title": "3.9 Navigate Complexity",
    "chapter": "3 PROJECT MANAGEMENT PRINCIPLES",
    "main_chapter": "THE STANDARD FOR PROJECT MANAGEMENT",
    "content": "A project is a system of elements that interact with each other. Complexity is a characteristic of a project or its environment that is difficult to manage due to human behavior, system behavior, and ambiguity. The nature and number of the interactions determine the degree of complexity in a project. Complexity emerges from project elements, interactions between project elements, and interactions with other systems and the project environment. Though complexity cannot be controlled, project teams can modify their activities to address impacts that occur as a result of complexity. Project teams often cannot foresee complexity emerging because it is the result of many interactions such as risks, dependencies, events, or relationships. Alternatively, a few causes may converge to produce a single complex effect, which makes isolating a specific cause of complexity difficult. Project complexity occurs as the result of individual elements within the project and project system as a whole. For example, complexity within a project may be amplified with a greater number or diversity of stakeholders, such as regulatory agencies, international financial institutions, multiple vendors, numerous specialty subcontractors, or local communities. These stakeholders can have a significant impact on the complexity of a project, both individually and collectively. Complexity is the result of human behavior, system interactions, uncertainty, and ambiguity. Complexity can emerge at any point during the project. Complexity can be introduced by events or conditions that affect value, scope, communications, stakeholders, risk, and technological innovation. Project teams can stay vigilant in identifying elements of complexity and use a variety of methods to reduce the amount or impact of complexity. Continually evaluate and navigate project complexity so that approaches and plans enable the project team to successfully navigate the project life cycle. Systems thinking also considers timing elements of systems, such as what the project delivers or enables over time. For example, if project deliverables are released incrementally, each increment expands the cumulative outcomes or capabilities of previous versions. Project teams should think beyond the end of the project to the operational state of the project’s deliverable, so that intended outcomes are realized. As projects unfold, internal and external conditions are continuously changing. A single change can create several impacts. For example, on a large construction project, a change in requirements can cause contractual changes with the primary contractor, subcontractors, suppliers, or others. In turn, those changes can create an impact on project cost, schedule, scope, and performance. Subsequently, these changes could invoke a change control protocol for obtaining approvals from entities in external systems, such as the service providers, regulators, financiers, and government authorities. While it is possible to predict some of the changes in advance, many of the changes that can impact the project during its life cycle emerge in real time. With systems thinking, including constant attention to internal and external conditions, the project team can navigate a wide spectrum of changes and impacts to keep the project in agreement with the relevant stakeholders. Systems thinking also applies to how the project team views itself and its interactions within the project system. The project system often brings together a diverse project team engaged in working for a common objective. This diversity brings value to project teams, but they need to consider how to leverage those differences effectively, so that the project team works cohesively. For example, if a government agency contracts with a private company for development of a new technology, the development team may consist of project team members from both organizations. Those project team members may have assumptions, ways of working, and mental models related to how they function within their home organization. In this new project system, which combines the cultures of a private company and a government agency, the project team members can establish a synthesized team culture that creates a common vision, language, and toolset. This can help project team members to engage and contribute effectively and help to increase the probability that the project system works. Because of the interactivity among systems, project teams should operate with awareness of, and vigilance toward, changing system dynamics. The following skills support a systems view of the project: Empathy with the business areas; Critical thinking with a big picture focus; Challenging of assumptions and mental models; Seeking external review and advice; Use of integrated methods, artifacts, and practices so there is a common understanding of project work, deliverables, and outcomes; Use of modeling and scenarios to envision how system dynamics may interact and react; and Proactive management of the integration to help achieve business outcomes. Complexity may emerge and impact the project in any area and at any point in the project life cycle. Project teams can identify elements of complexity throughout the project by continually looking at the project component as well as the project as a whole for signs of complexity. Knowledge of systems thinking, complex adaptive systems, experience from past project work, experimentation, and continuous learning related to system interaction leads to the project team’s increased ability to navigate complexity when it emerges. Being vigilant for indications of complexity allows project teams to adapt their approaches and plans to navigate potential disruption to effective project delivery.",
    "word_count": 801,
    "sentence_count": 24,
    "created_at": "2025-01-27T12:00:00.000Z"
  },
  {
    "id": 30,
    "section_number": "3.10",
    "title": "Optimize Risk Responses",
    "full_title": "3.10 Optimize Risk Responses",
    "chapter": "3 PROJECT MANAGEMENT PRINCIPLES",
    "main_chapter": "THE STANDARD FOR PROJECT MANAGEMENT",
    "content": "A risk is an uncertain event or condition that, if it occurs, can have a positive or negative effect on one or more objectives. Identified risks may or may not materialize in a project. Project teams endeavor to identify and evaluate known and emergent risks, both internal and external to the project, throughout the life cycle. Project teams seek to maximize positive risks (opportunities) and decrease exposure to negative risks (threats). Threats may result in issues such as delay, cost overrun, technical failure, performance shortfall, or loss of reputation. Opportunities can lead to benefits such as reduced time and cost, improved performance, increased market share, or enhanced reputation. Individual and overall risks can impact projects. Risks can be positive (opportunities) or negative (threats). Risks are addressed continually throughout the project. An organization’s risk attitude, appetite, and threshold influence how risk is addressed. Risk responses should be: Appropriate for the significance of the risk, Cost effective, Realistic within the project context, Agreed to by relevant stakeholders, and Owned by a responsible person. Project teams also monitor the overall project risk. Overall project risk is the effect of uncertainty on the project as a whole. Overall risk arises from all sources of uncertainty, including individual risks, and represents the exposure of the stakeholders to the implications of variations in project outcome, both positive and negative. Management of overall project risk aims to keep project risk exposure within an acceptable range. Management strategies include reducing drivers of threats, promoting drivers of opportunities, and maximizing the probability of achieving overall project objectives. Project team members engage with relevant stakeholders to understand their risk appetite and risk thresholds. Risk appetite describes the degree of uncertainty an organization or individual is willing to accept in anticipation of a reward. Risk threshold is the measure of acceptable variation around an objective that reflects the risk appetite of the organization and stakeholders. The risk threshold reflects the risk appetite. Therefore, a risk threshold of ±5% around a cost objective reflects a lower risk appetite than a risk threshold of ±10%. The risk appetite and risk threshold inform how the project team navigates risk in a project. Effective and appropriate risk responses can reduce individual and overall project threats and increase individual and overall opportunities. Project teams should consistently identify potential risk responses with the following characteristics in mind: Appropriate and timely to the significance of the risk, Cost effective, Realistic within the project context, Agreed to by relevant stakeholders, and Owned by a responsible person. Risks can exist within the enterprise, portfolio, program, project, and product. The project may be a component of a program in which the risk can potentially enhance or diminish benefits realization and, therefore, value. The project may be a component of a portfolio of related or unrelated work in which the risk can potentially enhance or diminish overall value of the portfolio and realization of business objectives. Organizations and project teams that employ consistent risk evaluation, planning, and proactive risk implementation often find the effort to be less costly than reacting to issues when the risk materializes. More information on risk management may be found in The Standard for Risk Management in Portfolios, Programs, and Projects [3].",
    "word_count": 614,
    "sentence_count": 21,
    "created_at": "2025-01-27T12:00:00.000Z"
  },
  {
    "id": 31,
    "section_number": "3.11",
    "title": "Embrace Adaptability and Resiliency",
    "full_title": "3.11 Embrace Adaptability and Resiliency",
    "chapter": "3 PROJECT MANAGEMENT PRINCIPLES",
    "main_chapter": "THE STANDARD FOR PROJECT MANAGEMENT",
    "content": "Most projects encounter challenges or obstacles at some stage. The combined attributes of adaptability and resiliency in the project team’s approach to a project help the project accommodate impacts and thrive. Adaptability refers to the ability to respond to changing conditions. Resiliency consists of two complementary traits: the ability to absorb impacts and the ability to recover quickly from a setback or failure. Both adaptability and resiliency are helpful characteristics for anyone working on projects. Build adaptability and resiliency into the organization’s and project team’s approaches to help the project accommodate change, recover from setbacks, and advance the work of the project. Adaptability is the ability to respond to changing conditions. Resiliency is the ability to absorb impacts and to recover quickly from a setback or failure. A focus on outcomes rather than outputs facilitates adaptability. A project rarely performs exactly as initially planned. Projects are influenced by internal and external factors—new requirements, issues, stakeholder influences, among other factors—which exist in a system of interactions. Some elements within a project may fail or fall short of expectations, requiring the project team to regroup, rethink, and replan. On an infrastructure project, for example, a court decision during project execution could change the designs and plans. In a technology project, a computerized model of the technology might show that the components work together properly, but the real-world application fails. In both cases, the project team will need to address the situation in order to move the project forward. The view that projects should hold firm to plans and commitments made during the early stages, even after new or unforeseen factors emerge, is not beneficial to stakeholders, including customers and end users, as this limits the potential for generating value. However, adapting should be done with a holistic view, such as a proper change control process, to avoid problems such as scope creep. In a project environment, capabilities that support adaptability and resilience include: Short feedback loops to adapt quickly; Continuous learning and improvement; Project teams with broad skill sets, coupled with individuals having extensive knowledge in each required skill area; Regular inspection and adaptation of project work to identify improvement opportunities; Diverse project teams to capture a broad range of experiences; Open and transparent planning that engages internal and external stakeholders; Small-scale prototypes and experiments to test ideas and try new approaches; Ability to leverage new ways of thinking and working; Process design that balances velocity of work and stability of requirements; Open organizational conversations; Diverse project teams with broad skill sets, cultures, and experience, coupled with subject matter experts in each required skill area; Understanding from past learning of the same or similar endeavors; Ability and willingness to anticipate multiple potential scenarios and prepare for multiple eventualities; Deferring decision making to the last responsible moment; Management support; and Open-ended design that balances speed and stability. Envisioning outcomes rather than deliverables can enable solutions, harnessing a better result than the one originally planned. For example, a project team may find an alternative solution that would provide stronger outcomes than the original defined deliverable. While exploration of alternatives is usually the purview of the business case, technologies and other capabilities are evolving so rapidly that a solution could emerge at any time between completion of the business case and project closure. Opportunities for adaptation may emerge during a project, at which time the project team should make a case to the project sponsor, product owner, or customer for capturing the opportunity. Depending on the type of contract, the customer’s approval may be needed for some of the changes that result from the adaptation. The project team should be prepared to adapt its plans and activities to take advantage of the opportunity, with the support of the project sponsor, product owner, or customer. Unexpected changes and circumstances in a project system can also present opportunities. To optimize value delivery, project teams should use problem solving as well as a holistic-thinking approach to changes and unplanned events. When an unplanned event occurs, project teams should look for potential positive outcomes that might be gained. For example, incorporating a change that occurs late in a project time line could add competitive advantage by being the first product in the market to offer the feature. Building adaptability and resiliency in a project keeps project teams focused on the desired outcome when internal and external factors change, and it helps them recover from setbacks. These characteristics also help project teams learn and improve so that they can quickly recover from failures or setbacks and continue making progress toward delivering value.",
    "word_count": 1048,
    "sentence_count": 31,
    "created_at": "2025-01-27T12:00:00.000Z"
  },
  {
    "id": 32,
    "section_number": "3.12",
    "title": "Enable Change to Achieve the Envisioned Future State",
    "full_title": "3.12 Enable Change to Achieve the Envisioned Future State",
    "chapter": "3 PROJECT MANAGEMENT PRINCIPLES",
    "main_chapter": "THE STANDARD FOR PROJECT MANAGEMENT",
    "content": "Remaining relevant in today’s business environment is a fundamental challenge for all organizations. Relevance entails being responsive to stakeholder needs and desires. This requires continually evaluating offerings for the benefit of stakeholders, rapidly responding to changes, and acting as agents for change. Project managers are uniquely poised to keep an organization prepared for changes. Projects, by their very definition, create something new: they are agents of change. Change management, or enablement, is a comprehensive, cyclic, and structured approach for transitioning individuals, groups, and organizations from a current state to a future state in which they realize desired benefits. It is different from project change control, which is a process whereby modifications to documents, deliverables, or baselines associated with the project are identified and documented, and then are approved or rejected. A structured approach to change helps individuals, groups, and the organization transition from the current state to a future desired state. Change can originate from internal influences or external sources. Enabling change can be challenging as not all stakeholders embrace change. Attempting too much change in a short time can lead to change fatigue and/or resistance. Stakeholder engagement and motivational approaches assist in change adoption. Prepare those impacted for the adoption and sustainment of new and different behaviors and processes required for the transition from the current state to the intended future state created by the project outcomes. Change in an organization can originate from internal sources, such as the need for a new capability or in response to a performance gap. Change can also originate from external sources such as technological advances, demographic changes, or socioeconomic pressures. Any type of change involves some level of adaptability or assimilation by the group experiencing the change as well as the industries with which the group interacts. Change may be implemented by and have consequences for stakeholders. Enabling stakeholder change is part of facilitating the project to provide the required deliverable as well as the intended outcome. Enabling change in an organization can be challenging. Some people may seem inherently resistant to change or risk averse, and environments may display a conservative culture, among other reasons. Effective change management uses a motivational strategy rather than a forceful one. Engagement and two-way communication create an environment in which adoption and assimilation of change can occur or identify some valid concerns from the resistant users that may need to be addressed. Project team members and project managers can work with relevant stakeholders to address resistance, fatigue, and change absorption to increase the probability that change will be adopted or assimilated successfully by customers or recipients of project deliverables. This includes communicating the vision and goals associated with the change early in the project to achieve buy-in for the change. The benefits of the change and the impact on work processes should be communicated to all levels of the organization throughout the project. It is also important to adapt the speed of change to the change appetite, cost, and ability of the stakeholders and the environment to assimilate change. Attempting to create too many changes in too short a time can lead to resistance because of change saturation. Even when stakeholders unanimously agree that change will produce more value or enhance outcomes, they often still have difficulty working through the actions that will deliver enhanced benefits. To foster benefits realization, the project may also include activities to reinforce the change after its implementation in order to avoid people returning to the initial state. Recognizing and addressing the needs of stakeholders to embrace change throughout the project life cycle helps to integrate the resulting change in the project work, making a successful outcome more likely. More information on organizational change management may be found in Managing Change in Organizations: A Practice Guide [4].",
    "word_count": 650,
    "sentence_count": 24,
    "created_at": "2025-01-27T12:00:00.000Z"
  }
]
